from Pbxbot.core.clients import Pbxbot
from Pbxbot.core.config import Config, Symbols
from Pbxbot.core.database import db
from Pbxbot.plugins.help import BotHelp


START_MSG = """
**┌────── ˹ ᴘʙx 4.0 ˼ ⏤͟͞★**
**┆◍ ʜᴇʏ : {0}**
**┆● ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ᴘʙx ᴜsᴇʀʙᴏᴛ**
**└────────────────•**

**➻ ꜰᴀsᴛ & ᴘᴏᴡᴇʀꜰᴜʟ ᴛᴇʟᴇɢʀᴀᴍ ᴜsᴇʀʙᴏᴛ**
**➻ ᴍᴜʟᴛɪ-sᴇssɪᴏɴ • sᴘᴀᴍ • ᴍᴇᴅɪᴀ sᴀᴠᴇ**
**➻ ʀᴀɪᴅ • ᴄʟᴏɴᴇ • ɪᴅ ʙᴏᴏsᴛ**

**•── ⋅ ⋅ ────── ⋅ ⋅ ──•**

**❖ ᴜsᴇ /session ᴛᴏ ᴀᴅᴅ sᴇssɪᴏɴ**
**❖ ᴜsᴇ .help ꜰᴏʀ ᴄᴏᴍᴍᴀɴᴅs**

**•── ⋅ ⋅ ────── ⋅ ⋅ ──•**

**๏ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :**
[ʙᴀᴅᴍᴜɴᴅᴀ](https://t.me/Badmundaxd)
"""


HELP_MSG = """
**┌────── ˹ ᴘʙx ʜᴇʟᴘ ˼ ⏤͟͞★**
**┆◍ ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs**
**└────────────────•**

**➻ /start - sᴛᴀʀᴛ ʙᴏᴛ**
**➻ /session - ᴀᴅᴅ sᴇssɪᴏɴ**
**➻ .help - ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs**
**•── ⋅ ⋅ ────── ⋅ ⋅ ──•**

**๏ ꜱᴜᴘᴘᴏʀᴛ :**
[PBX_UPDATE](https://t.me/PBX_UPDATE) •
[PBXCHATS](https://t.me/PBXCHATS)
"""


SOURCE_GUIDE = """
**┌────── ˹ ᴘʙx ɢᴜɪᴅᴇ ˼ ⏤͟͞★**
**┆◍ ǫᴜɪᴄᴋ sᴇᴛᴜᴘ**
**└────────────────•**

**➻ 1 : sᴇɴᴅ /session**
**➻ 2 : sᴇɴᴅ ɴᴜᴍʙᴇʀ**
**➻ 3 : sᴇɴᴅ ᴏᴛᴘ**
`1 2 3 4 5`

**•── ⋅ ⋅ ────── ⋅ ⋅ ──•**

**❖ ʙᴀsɪᴄ sᴇssɪᴏɴ :**
**◍ ᴀʟʟ ʙᴀsɪᴄ ꜰᴇᴀᴛᴜʀᴇs**
**◍ ʀᴀɪᴅ • ᴄʟᴏɴᴇ • ᴛᴀɢɢᴇʀ**
**◍ ᴍᴇᴅɪᴀ sᴀᴠᴇ • ɪᴅ ʙᴏᴏsᴛ**

**•── ⋅ ⋅ ────── ⋅ ⋅ ──•**

**❖ ɪꜰ 2-ꜱᴛᴇᴘ ᴏɴ**
**◍ sᴇɴᴅ ᴘᴀssᴡᴏʀᴅ ᴀꜰᴛᴇʀ ᴏᴛᴘ**

**๏ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :**
[ʙᴀᴅᴍᴜɴᴅᴀ](https://t.me/Badmundaxd)
"""
